# Problem Set 4

**It is still true that there's usually more than one way to achive the same result. As such, these answers show just one (or two) possibilities. You can have a perfectly valid code which achieves the same but differs from below.**

**0.** Housekeeping: Import pandas under the name `pd`, see the version, import NumPy as `np`, set some settings:

In [5]:
import numpy as np   
np.random.seed(12345)
np.set_printoptions(precision=4, suppress=True)
import pandas as pd
from pandas import Series, DataFrame   # saves on typing pd.
pd.options.display.max_rows = 20
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
pd.__version__       # Print the version of pandas that has been imported

'1.1.3'

### Q1  Basic Data Management

**1.1.**  Consider the following Python dictionary `data` and Python list `labels`. 

Complete the code to create a DataFrame `df` from this dictionary `data` which has the index `labels`. Display a summary of the basic information about this DataFrame and its data.

In [6]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 4, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1.2.** Select (for readability, do each one in a separate cell):
 - the first 3 rows for this data frame.
 - just the 'animal' and 'age' columns from the DataFrame `df`.
 - the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.
 - the rows where the number of visits is 3 or more.
 - the rows where the age is missing, i.e. is `NaN`. **Hint:** isnull
 - the rows where the animal is a cat *and* the age is less than 3.
 - Select the rows for which the age is between 2 and 4 (inclusive). **Hint:** between

**1.3.** Calculate:
 - the sum of all visits (the total number of visits). 
 - the mean age for each different animal.
 - Count the number of each type of animal . 
 
**Hint:** use `sum`, `group_by`, `value_counts`

**1.4.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visit' column in *ascending* order. **Hint:** sort_values

**1.5.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`. **Hint:** map

## Q2: Grouping Data

**2.1.** For DataFrame below, has a column of groups 'grps' and and column of numbers 'vals'. For each *group*, find the sum of the three greatest values. **Hint:** groupby, nlargest, sum(level=0). Notice that `nlargest` returns a multiindexed series so the `level=0` keeps the sum at the outer level.

In [ ]:
df = DataFrame({'grps': list('aaabbcaabcccbbc'), 
                'vals': [12,345,-3,1,45,14,4,52,54,23,235,-21,57,-3,87]})

**2.2.** Given a DataFrame with a column of group IDs, 'grps', and a column of corresponding integer values, 'vals', as in question 7, replace any negative values in 'vals' with the group mean. **Hint:** write an appropriate function and then pass it to `transform` after `groupby`

### Q3  Data Cleaning

The task is to tidy up the following DataFrame:

In [ ]:
df_1 = DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

Below is the target output you would like to create:
<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>FlightNumber</th>
      <th>Airline</th>
      <th>From</th>
      <th>To</th>
      <th>delay_1</th>
      <th>delay_2</th>
      <th>delay_3</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>10045</td>
      <td>KLM</td>
      <td>London</td>
      <td>Paris</td>
      <td>23.0</td>
      <td>47.0</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>10055</td>
      <td>Air France</td>
      <td>Madrid</td>
      <td>Milan</td>
      <td>NaN</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>10065</td>
      <td>British Airways</td>
      <td>London</td>
      <td>Stockholm</td>
      <td>24.0</td>
      <td>43.0</td>
      <td>87.0</td>
    </tr>
    <tr>
      <th>3</th>
      <td>10075</td>
      <td>Air France</td>
      <td>Budapest</td>
      <td>Paris</td>
      <td>13.0</td>
      <td>NaN</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>4</th>
      <td>10085</td>
      <td>Swiss Air</td>
      <td>Brussels</td>
      <td>London</td>
      <td>67.0</td>
      <td>32.0</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>


That is we need to:
 - Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column). **Hint:** `interpolate`, `astype`
 - The From\_To column would be better as two separate columns! Split each string on the underscore delimiter `_` to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame. **Hint:** `str.split()` will create a list split on a character, and the optional argument `expand=True` will create a column for each entry in the list.
 - Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".) **Hint:** `str.capitalize`
 - Delete the From_To column from `df` and attach the temporary DataFrame you have created. **Hint:** drop, join
 - In the Airline column, you can see some extra punctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. `'(British Airways. )'` should become `'British Airways'`. **Hint:** `str.extract('([a-zA-Z\s]+)', expand=False)` will pull out only the letters.
 - In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. Expand the Series of lists into a DataFrame named `delays`, rename the columns `delay_1`, `delay_2`, etc. and replace the unwanted RecentDelays column in `df` with `delays`. **Hint:**  Create a temporary df then join it: using `.apply(pd.Series)` will take the list and create a a column for each entry.